{
  "keywords": {
    "using": "USING is useful when both the tables share a column of the exact same name on which they join.",
    "btree": "A B-tree is a balanced tree not a binary tree. Once created, the database maintains the index automatically. It applies every insert, delete and update to the index and keeps the tree in balance, thus causing maintenance overhead for write operations.",
    "engine": "Storage engines are MySQL components that handle the SQL operations for different table types. InnoDB is the default and most general-purpose storage engine, and Oracle recommends using it for tables except for specialized use cases.",
    "aria": "Aria is a storage engines for the MariaDB and MySQL relational database management systems. Its goal is to make a crash-safe alternative to MyISAM.",
    "auto_increment": "AUTO_INCREMENT is a function that operates on numeric data types. It automatically generates sequential numeric values every time that a record is inserted into a table for a field defined as auto increment.",
    "bigint": "A large integer. Signed range is from -9223372036854775808 to 9223372036854775807. Unsigned range is from 0 to 18446744073709551615. The size parameter specifies the maximum display width (which is 255).",
    "binary": "The BINARY and VARBINARY types are similar to CHAR and VARCHAR, except that they contain binary strings rather than nonbinary strings. That is, they contain byte strings rather than character strings. This means they have the binary character set and collation, and comparison and sorting are based on the numeric values of the bytes in the values.",
    "bit": "A bit-value type. The number of bits per value is specified in size. The size parameter can hold a value from 1 to 64. The default value for size is 1.",
    "blob": "For BLOBs (Binary Large OBjects). Hsql_references.jsonolds up to 65,535 bytes of data.",
    "bool": "Zero is considered as false, nonzero values are considered as true.",
    "boolean": "Zero is considered as false, nonzero values are considered as true.",
    "char": "A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1.",
    "charset": "A MySQL character set is a set of characters that are legal in a string. For example, we have an alphabet with letters from A to Z.",
    "collate": "A MySQL collation is a set of rules used to compare characters in a particular character set. Each character set in MySQL can have more than one collation, and has, at least, one default collation. Two character sets cannot have the same collation.",
    "comment": "A comment for a column can be specified with the COMMENT option, up to 1024 characters long.",
    "create table": "CREATE TABLE creates a table with the given name. You must have the CREATE privilege for the table.",
    "csv": "Its tables are really text files with comma-separated values. CSV taReferences of create table sql code for MySQL/MariaDBbles let you import or dump data in CSV format, to exchange data with scripts and applications that read and write that same format. Because CSV tables are not indexed, you typically keep the data in InnoDB tables during normal operation, and only use CSV tables during the import or export stage.",
    "current_timestamp": "The CURRENT_TIMESTAMP function returns the current date and time.",
    "dec": "An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0.",
    "decimal": "An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0.",
    "default": "The DEFAULT function returns the default value for table column. DEFAULT value of a column is a value used in the case, there is no value specified by user. In order, to use this function there should be a DEFAULT value assign to the column. Otherwise, it will generate an error.",
    "double": "A normal-size floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter.",
    "engines": "Storage engines are MySQL components that handle the SQL operations for different table types.",
    "enum": "A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them.",
    "float": "A floating point number. MySQL uses the p value to determine whether to use FLOAT or DOUBLE for the resulting data type. If p is from 0 to 24, the data type becomes FLOAT(). If p is from 25 to 53, the data type becomes DOUBLE().",
    "datetime": "The DATETIME type is used for values that contain both date and time parts. MySQL retrieves and displays DATETIME values in 'YYYY-MM-DD hh:mm:ss' format. The supported range is '1000-01-01 00:00:00' to '9999-12-31 23:59:59'.",
    "foreign": "A FOREIGN KEY is a field (or collection of fields) in one table that refers to the PRIMARY KEY in another table.",
    "innodb": "The default storage engines in MySQL 8.0. InnoDB is a transaction-safe (ACID compliant) storage engines for MySQL that has commit, rollback, and crash-recovery capabilities to protect user data. InnoDB row-level locking (without escalation to coarser granularity locks) and Oracle-style consistent nonlocking reads increase multi-user concurrency and performance. InnoDB stores user data in clustered indexes to reduce I/O for common queries based on primary keys. To maintain data integrity, InnoDB also supports FOREIGN KEY referential-integrity constraints.",
    "int": "A medium integer. Signed range is from -2147483648 to 2147483647. Unsigned range is from 0 to 4294967295. The size parameter specifies the maximum display width (which is 255).",
    "key": "A key is a single or combination of multiple fields in a table. It is used to fetch or retrieve records/data-rows from data table according to the condition/requirement. Keys are also used to create a relationship among different database tables or views.",
    "longblob": "For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data.",
    "longtext": "Holds a string with a maximum length of 4,294,967,295 characters.",
    "mediumblob": "For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data.",
    "mediumint": "A medium integer. Signed range is from -8388608 to 8388607. Unsigned range is from 0 to 16777215. The size parameter specifies the maximum display width (which is 255).",
    "mediumtext": "Holds a string with a maximum length of 16,777,215 characters.",
    "memory": "Stores all data in RAM, for fast access in environments that require quick lookups of non-critical data. This engines was formerly known as the HEAP engines. Its use cases are decreasing; InnoDB with its buffer pool memory area provides a general-purpose and durable way to keep most or all data in memory, and NDBCLUSTER provides fast key-value lookups for huge distributed data sets.",
    "mgr_myisam": "The MERGE storage engines, also known as the MRG_MyISAM engines, is a collection of identical MyISAM tables that can be used as one. “Identical” means that all tables have identical column data types and index information. You cannot merge MyISAM tables in which the columns are listed in a different order, do not have exactly the same data types in corresponding columns, or have the indexes in different order. However, any or all of the MyISAM tables can be compressed with myisampack.",
    "myisam": "These tables have a small footprint. Table-level locking limits the performance in read/write workloads, so it is often used in read-only or read-mostly workloads in Web and data warehousing configurations.",
    "not null": "The NOT NULL constraint enforces a column to not accept NULL values, which means that you cannot insert or update a record without adding a value to this field.",
    "null": "A field with a NULL value is a field with no value.",
    "performance_schema": "The Performance Schema provides a way to inspect internal execution of the server at runtime. It is implemented using the PERFORMANCE_SCHEMA storage engines and the performance_schema database. The Performance Schema focuses primarily on performance data. This differs from INFORMATION_SCHEMA, which serves for inspection of metadata.",
    "primary": "A PRIMARY KEY is a unique index where all key columns must be defined as NOT NULL. If they are not explicitly declared as NOT NULL. A table can have only one PRIMARY KEY. The name of a PRIMARY KEY is always PRIMARY, which thus cannot be used as the name for any other kind of index.",
    "sequence": "A Sequence engines allows the creation of ascending or descending sequences of numbers (positive integers) with a given starting value, ending value and increment.",
    "smallint": "A small integer. Signed range is from -32768 to 32767. Unsigned range is from 0 to 65535. The size parameter specifies the maximum display width (which is 255).",
    "text": "Holds a string with a maximum length of 65,535 byte.",
    "tinyblob": "For BLOBs (Binary Large OBjects). Max length: 255 bytes.",
    "tinyint": "A very small integer. Signed range is from -128 to 127. Unsigned range is from 0 to 255. The size parameter specifies the maximum display width (which is 255).",
    "tinytext": "Holds a string with a maximum length of 255 characters.",
    "unique": "A UNIQUE index creates a constraint such that all values in the index must be distinct. An error occurs if you try to add a new row with a key value that matches an existing row.",
    "unsigned": "UNSIGNED allows us to enter positive value; you cannot give any negative number. Let us create a table to understand unsigned in MySQL.",
    "varbinary": "The BINARY and VARBINARY types are similar to CHAR and VARCHAR, except that they contain binary strings rather than nonbinary strings. That is, they contain byte strings rather than character strings. This means they have the binary character set and collation, and comparison and sorting are based on the numeric values of the bytes in the values.",
    "varchar": "A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535.",
    "temporary": "In MySQL, a temporary table is a special type of table that allows you to store a temporary result set, which you can reuse several times in a single session.",
  }
}
